---
kind: property
id: P:Autodesk.Revit.DB.GroupSet.Size
source: html/7b48488e-5f9f-3acc-5752-c8eea80d17f9.htm
---
# Autodesk.Revit.DB.GroupSet.Size Property

Returns the number of groups that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```